tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/services"

# Better versions of Mac built-ins
brew "bash"
brew "gnu-sed"
brew "rsync"
brew "the_silver_searcher"

# Bash completions
brew "bash-completion@2"
brew "pip-completion"

# General development
brew "automake"
brew "bfg"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "hadolint"

# Node
brew "nvm"

# Python development
brew "gdbm"
brew "pyenv", args: ["HEAD"]
brew "pyenv-virtualenvwrapper"

# pyenv recommended
brew "readline"
brew "sqlite"
brew "xz"
brew "zlib"

# Ruby development
brew "chruby"
brew "libyaml"
brew "ruby-install"

# Needed for magic
brew "libmagic"

# More nice-to-haves and various development tools
brew "autojump"
brew "bat"
brew "direnv"
brew "dive"
brew "eza"
brew "fd"
brew "fzf"
brew "graphviz"
brew "httpie"
brew "jq"
brew "m-cli"
brew "multimarkdown"
brew "openssl"
brew "pandoc"
brew "pwgen"
brew "qpdf"
brew "shellcheck"
brew "speedtest-cli"
brew "ssh-copy-id"
brew "starship"
brew "swig"
brew "tmate"
brew "tmux"
brew "trash"
brew "tree"
brew "wdiff"
brew "wget"

# tmux copy and paste
brew "reattach-to-user-namespace"

# tmux PAM reattch for Touch ID
brew "pam-reattach"

# Needed for node sharp (personal-site)
brew "libvips"

## neovim
brew "neovim"
cask "vimr"
brew "ripgrep"

# Quick Look plugins
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"

# ASD
## AWS
brew "awscli"
cask "session-manager-plugin"

## terraform
brew "tfenv"

# Apps
cask "1password", greedy: true
cask "1password-cli", greedy: true
cask "alfred", greedy: true
cask "appcleaner"
cask "arc", greedy: true
cask "bartender", greedy: true
cask "betterdisplay", greedy: true
cask "carbon-copy-cloner", greedy: true
cask "chatgpt"
cask "cheatsheet"
cask "coconutbattery"
cask "cyberduck"
cask "daisydisk"
cask "dbeaver-community", greedy: true
cask "discord"
cask "docker", greedy: true
cask "dropbox", greedy: true
cask "evernote"
cask "firefox"
cask "focusatwill"
cask "fsnotes", greedy: true
cask "google-chrome"
cask "istat-menus", greedy: true
cask "keepingyouawake"
cask "keyboardcleantool"
cask "mactracker"
cask "marked", greedy: true
cask "menuwhere"
cask "micro-snitch"
cask "ngrok"
cask "p4v", greedy: true
cask "pester"
cask "rapidapi"
cask "screenflow"
cask "shottr"
cask "slack", greedy: true
cask "sloth"
cask "soundsource", greedy: true
cask "sourcetree", greedy: true
cask "taskpaper"
cask "the-unarchiver"
cask "vlc"
cask "whatsapp"
cask "zoom", greedy: true

# Fonts
tap "homebrew/cask-fonts"
cask "font-sauce-code-pro-nerd-font"

## Other potential font options
# cask "font-anonymice-nerd-font"
# cask "font-blex-mono-nerd-font"
# cask "font-caskaydia-cove-nerd-font"
# cask "font-droid-sans-mono-nerd-font"
# cask "font-fira-mono-nerd-font"
# cask "font-hasklug-nerd-font"
# cask "font-inconsolata-lgc-nerd-font"
# cask "font-jetbrains-mono-nerd-font"
